BEGIN;

/* Выборка №1 */

SELECT 
	Н_ЛЮДИ.ОТЧЕСТВО AS second_name, 
	Н_ВЕДОМОСТИ.ИД as document_id
FROM 
	Н_ЛЮДИ INNER JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД 
WHERE 
	Н_ЛЮДИ.ФАМИЛИЯ < 'Афанасьев' 
	AND Н_ВЕДОМОСТИ.ИД < 1490007;

/* Выборка №2 */

SELECT 
	Н_ЛЮДИ.ОТЧЕСТВО AS second_name,
	Н_ВЕДОМОСТИ.ИД AS document_id,
	Н_СЕССИЯ.ДАТА AS date_of_exam
FROM 
	Н_ВЕДОМОСТИ LEFT JOIN (Н_ЛЮДИ LEFT JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД) ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД 
WHERE 
	Н_ЛЮДИ.ОТЧЕСТВО = 'Георгиевич' 
	AND Н_ВЕДОМОСТИ.ЧЛВК_ИД > 117219;

/* Выборка №3 */

SELECT 
	COUNT(Н_ДИСЦИПЛИНЫ.КОРОТКОЕ_ИМЯ) as number_of_disciplines
FROM 
	Н_ДИСЦИПЛИНЫ 
WHERE 
	Н_ДИСЦИПЛИНЫ.КОРОТКОЕ_ИМЯ IN (SELECT
		Н_ДИСЦИПЛИНЫ.КОРОТКОЕ_ИМЯ 
	FROM 
		Н_ДИСЦИПЛИНЫ 
	GROUP BY 
		Н_ДИСЦИПЛИНЫ.КОРОТКОЕ_ИМЯ);

/* Выборка №4 */

SELECT 
	DISTINCT Н_УЧЕНИКИ.ГРУППА AS group
FROM 
	Н_УЧЕНИКИ 
WHERE 
	Н_УЧЕНИКИ.НАЧАЛО <= '12-12-2011' 
	AND Н_УЧЕНИКИ.КОНЕЦ >= '01-01-2011'
GROUP BY 
	Н_УЧЕНИКИ.ГРУППА 
HAVING
	COUNT(
		Н_УЧЕНИКИ.ПЛАН_ИД IN (SELECT 
				Н_ПЛАНЫ.ИД 
			FROM
				Н_ПЛАНЫ
			WHERE 
				Н_ПЛАНЫ.ОТД_ИД IN (SELECT 
					Н_ОТДЕЛЫ.ИД 
				FROM 
					Н_ОТДЕЛЫ 
				WHERE 
				Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ'))
) > 5;

/* Выборка №5 */

SELECT 
    Н_УЧЕНИКИ.ЧЛВК_ИД AS isu_id, 
    Н_ЛЮДИ.ФАМИЛИЯ AS last_name, 
    Н_ЛЮДИ.ИМЯ AS first_name, 
    Н_ЛЮДИ.ОТЧЕСТВО AS second_name, 
    AVG(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)) AS avg_score
FROM 
    (Н_УЧЕНИКИ 
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД) 
    JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД 
WHERE 
    Н_УЧЕНИКИ.ГРУППА = '4100' 
    AND Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5') 
GROUP BY 
    Н_УЧЕНИКИ.ЧЛВК_ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО
HAVING 
    AVG(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)) <= (
        SELECT MAX(max_value_from_group_1101) 
        FROM (
            SELECT AVG(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)) AS max_value_from_group_1101
            FROM Н_УЧЕНИКИ 
            JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД 
            WHERE 
                Н_УЧЕНИКИ.ГРУППА = '1101' 
                AND Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5')
            GROUP BY Н_УЧЕНИКИ.ЧЛВК_ИД
        ) AS max_value_from_group_1101_table
    );

/* Выборка №6 */

SELECT 
	Н_УЧЕНИКИ.ГРУППА AS group,
	Н_УЧЕНИКИ.ЧЛВК_ИД AS isu_id, 
    Н_ЛЮДИ.ФАМИЛИЯ AS last_name, 
    Н_ЛЮДИ.ИМЯ AS first_name, 
    Н_ЛЮДИ.ОТЧЕСТВО AS second_name, 
	Н_УЧЕНИКИ.П_ПРКОК_ИД AS admission_order_item,
	Н_УЧЕНИКИ.ПРИЗНАК AS current_state_in_learning
FROM 
	(Н_УЧЕНИКИ JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД) JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД 
WHERE
	Н_УЧЕНИКИ.НАЧАЛО > '01-09-2012'
	AND Н_ПЛАНЫ.КУРС = 1
	AND Н_УЧЕНИКИ.СОСТОЯНИЕ = 'утвержден'
	AND Н_ПЛАНЫ.ФО_ИД IN (SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ WHERE НАИМЕНОВАНИЕ = 'Заочная')
	AND Н_ПЛАНЫ.НАПС_ИД IN (SELECT
		Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД
	FROM 
		Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ JOIN Н_НАПР_СПЕЦ ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = Н_НАПР_СПЕЦ.ИД 
	WHERE 
		Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101');

/* Выборка №7 */

SELECT 
	COUNT(ЧЛВК_ИД) AS bad_studs_amount
FROM (SELECT DISTINCT Н_УЧЕНИКИ.ЧЛВК_ИД FROM Н_УЧЕНИКИ JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД 
WHERE 
	Н_УЧЕНИКИ.ГРУППА = '3100' 
	AND Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5')
GROUP BY Н_УЧЕНИКИ.ЧЛВК_ИД
HAVING
	AVG(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)) < 3.5) AS bad_studs_table;

END;